# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'teamookla/speedtest'

# Install Binaries
brew 'agg' # asciicast to gif converter
brew 'asdf'
brew 'asciinema'
brew 'awscli'
brew 'bash' # Bash 4
brew 'colima'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ctop'
brew 'ffmpeg'
brew 'gettext'
brew 'gifsicle'
brew 'git'
brew 'gitlab-runner' unless system "ls ~/.personal_laptop"
brew 'graphviz'
brew 'grep'
brew 'grpcurl'
brew 'hub'
brew 'jpegoptim'
brew 'jq'
brew 'kubernetes-cli'
brew 'helm'
brew 'libusb' # required to identify id-token
brew 'lnav'
brew 'minikube'
# brew 'mackup'
brew 'mas'
brew 'p7zip'
# brew 'packer'
brew 'pngquant'
brew 'speedtest'
brew 'svn' # other brews depend on this one
brew 'telnet'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vegeta'
brew 'watch'
brew 'wget'
brew 'yamllint'
brew 'yq'

# Those are now default on mac
# brew 'zsh'
# brew 'zsh-completions'

# Development
brew 'openjdk'
brew 'go'
brew 'crystal'

# Apps
cask 'adobe-acrobat-reader'
# cask 'aerial' # awesome, but consume a lot of my HD
cask 'caffeine'
# cask 'chef/chef/chefdk'
cask 'charles'
cask 'clocker'
cask 'docker'
# cask 'firefox'
# cask 'free-ruler'
cask 'goland' # go IDE
# cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'gimp'
cask 'grammarly'
# cask 'insomnia' # Like postman
cask 'iterm2'
cask 'intellij-idea-ce' # If you don't have license
# cask 'intellij-idea' # if you have license =D
cask 'lens' # kube IDE
cask 'meld' # git mergetool
cask 'microsoft-excel' if system "ls ~/.personal_laptop"
# cask 'microsoft-remote-desktop-beta'
cask 'microsoft-word' if system "ls ~/.personal_laptop"
cask 'notion'
cask 'orbstack' # docker desktop/colima alternative
cask 'rancher' unless system "ls ~/.personal_laptop"  # free docker alternative
cask 'rectangle' # screen windows organize
cask 'rescuetime'
# cask 'shuttle' # Maybe in the future
cask 'slack'
cask 'sublime-text'
# cask 'skype'
cask 'sourcetree'
# cask 'spin' # spinnaker cli
cask 'the-unarchiver' # finder rar support
# cask 'transmit'
cask 'vagrant'
# cask 'vault'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
# cask 'webex'
cask 'whatsapp' if system "ls ~/.personal_laptop"

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
# mas '1Password', id: 1333542190
# mas 'Byword', id: 420212497
# mas 'Deckset', id: 847496013
# mas 'Giphy Capture', id: 668208984
# mas 'Sip', id: 507257563
# mas 'Spark', id: 1176895641
# mas 'The Unarchiver', id: 425424353
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
