# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'asciinema'
brew 'awscli'
brew 'bash' # Bash 4
brew 'circleci'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ctop'
brew 'dep'
brew 'gettext'
brew 'git'
brew 'gitlab-runner'
brew 'graphviz'
brew 'grep'
brew 'hub'
brew 'jfrog-cli-go'
brew 'jpegoptim'
brew 'jq'
brew 'kops'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'lnav'
brew 'mackup'
brew 'mas'
brew 'p7zip'
brew 'packer'
brew 'pngquant'
brew 'telnet'
brew 'terragrunt'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'yq'
brew 'yamllint'
brew 'wget'
brew 'warrensbox/tap/tfswitch'

# Development
brew 'go'
brew 'node'
brew 'terraform'
brew 'rbenv'

# Apps
cask 'adobe-acrobat-reader'
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'chef/chef/chefdk'
cask 'clocker'
cask 'docker'
cask 'firefox'
cask 'free-ruler'
cask 'goland'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'gimp'
cask 'grammarly'
# cask 'insomnia' # Like postman
cask 'iterm2'
# cask 'intellij-idea-ce' # If you don't have license
cask 'intellij-idea' # if you have license =D
cask 'java'
cask 'lens' # kube IDE
cask 'microsoft-remote-desktop-beta'
cask 'minikube'
cask 'rescuetime'
cask 'shuttle' # Maybe in the future
cask 'slack'
cask 'sublime-text'
cask 'skype'
cask 'sourcetree'
cask 'spin' # spinnaker cli
# cask 'transmit'
cask 'vagrant'
cask 'vault'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
# mas '1Password', id: 1333542190
# mas 'Byword', id: 420212497
# mas 'Deckset', id: 847496013
# mas 'Giphy Capture', id: 668208984
# mas 'Sip', id: 507257563
# mas 'Spark', id: 1176895641
# mas 'The Unarchiver', id: 425424353
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
# mas 'WhatsApp', id: 1147396723 
